BUILD/doc/source/_static/soap_outputs/6.5.314.4301/ask_parsed_question_pick_first_step_4_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <selects>
            <select>
              <sensor>
                <hash>3409330187</hash>
                <name>Computer Name</name>
                <id>3</id>
              </sensor>
            </select>
            <select>
              <sensor>
                <hash>435227963</hash>
                <name>IP Route Details</name>
                <delimiter>|</delimiter>
                <id>568</id>
              </sensor>
            </select>
          </selects>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>